## **11. Pandas的索引index的用途**

把数据存于普通的column列，也能用于查询，那使用index有什么好处呢？

index的用途总结：  
1. 更方便的数据查询
2. 使用index可以获得性能提升
3. 自动的数据对齐功能
4. 更多更强大的数据结构支持

In [21]:
import pandas as pd
import numpy as np

In [46]:
#读取是指定了code列的数据类型，否则，部分股票代码会被作为整型数据读如，（000651）前面的0没有了
df=pd.read_csv('./stocks/df8.csv',dtype={'code':'object'})

In [47]:
df.head(5)

           rq     kp     zg     zd     sp         cjl           cje    code
0  2020/11/16  1.556  1.620  1.451  1.465  1445363837  2.119241e+09  588000
1  2020/11/17  1.460  1.460  1.430  1.436  1080636535  1.553722e+09  588000
2  2020/11/18  1.435  1.445  1.422  1.424   863188131  1.234789e+09  588000
3  2020/11/19  1.424  1.440  1.412  1.438   685401807  9.803946e+08  588000
4  2020/11/20  1.436  1.444  1.431  1.435   601003363  8.626239e+08  588000

In [48]:
df.count()

rq      13321
kp      13321
zg      13321
zd      13321
sp      13321
cjl     13321
cje     13321
code    13321
dtype: int64

In [49]:
df.dtypes

rq       object
kp      float64
zg      float64
zd      float64
sp      float64
cjl       int64
cje     float64
code     object
dtype: object

### **11.1 使用index查询数据**

In [50]:
# 1. 重新设置索引列，以'code'和'rq'共同组成索引，且组成索引的两个列仍保留在columns中
# 2. drop=False的作用是保留索引列在columns中
# 3. 组合索引用list给出
# 4. 行索引、列索引都不是数据集本身的组成部分
df.set_index(['code','rq'],drop=False,inplace=True)

In [51]:
df

                           rq      kp      zg      zd      sp         cjl  \
code   rq
588000 2020/11/16  2020/11/16   1.556   1.620   1.451   1.465  1445363837
       2020/11/17  2020/11/17   1.460   1.460   1.430   1.436  1080636535
       2020/11/18  2020/11/18   1.435   1.445   1.422   1.424   863188131
       2020/11/19  2020/11/19   1.424   1.440   1.412   1.438   685401807
       2020/11/20  2020/11/20   1.436   1.444   1.431   1.435   601003363
...                       ...     ...     ...     ...     ...         ...
300124 2023/04/03  2023/04/03  70.620  71.130  69.700  70.600     9947794
       2023/04/04  2023/04/04  70.650  70.670  68.850  69.690     9446887
       2023/04/06  2023/04/06  69.150  69.940  68.160  69.360     7935432
       2023/04/07  2023/04/07  69.330  69.660  68.310  68.520     9430855
       2023/04/10  2023/04/10  68.600  69.950  68.060  69.100     7135749

                            cje    code
code   rq
588000 2020/11/16  2.119241e+09  588000
       2020/11/17  1.553722e+09  588000
       2020/11/18  1.234789e+09  588000
       2020/11/19  9.803946e+08  588000
       2020/11/20  8.626239e+08  588000
...                         ...     ...
300124 2023/04/03  7.001108e+08  300124
       2023/04/04  6.569337e+08  300124
       2023/04/06  5.485338e+08  300124
       2023/04/07  6.497204e+08  300124
       2023/04/10  4.927899e+08  300124

[13321 rows x 8 columns]

In [52]:
#注意，组合索引是用元组表示的
df.index

MultiIndex([('588000', '2020/11/16'),
            ('588000', '2020/11/17'),
            ('588000', '2020/11/18'),
            ('588000', '2020/11/19'),
            ('588000', '2020/11/20'),
            ('588000', '2020/11/23'),
            ('588000', '2020/11/24'),
            ('588000', '2020/11/25'),
            ('588000', '2020/11/26'),
            ('588000', '2020/11/27'),
            ...
            ('300124', '2023/03/27'),
            ('300124', '2023/03/28'),
            ('300124', '2023/03/29'),
            ('300124', '2023/03/30'),
            ('300124', '2023/03/31'),
            ('300124', '2023/04/03'),
            ('300124', '2023/04/04'),
            ('300124', '2023/04/06'),
            ('300124', '2023/04/07'),
            ('300124', '2023/04/10')],
           names=['code', 'rq'], length=13321)

In [53]:
#查询数据，不使用索引
df.loc[(df['code']=='300124')&(df['rq']=='2023/03/31')]

,,rq,kp,zg,zd,sp,cjl,cje,code
code,rq,,,,,,,,
300124,2023/03/31,2023/03/31,71.24,71.35,70.03,70.3,8400241,591385344.0,300124

In [54]:
#查询数据，使用索引，有所简化.
#注意：组合索引需要用元组形式给出
df.loc[('300124','2023/03/31')]
#查询结果相同，但命令有所简化

rq       2023/03/31
kp            71.24
zg            71.35
zd            70.03
sp             70.3
cjl         8400241
cje     591385344.0
code         300124
Name: (300124, 2023/03/31), dtype: object

In [55]:
df.loc[('000651','2015/09/02')]

rq        2015/09/02
kp             17.55
zg              18.2
zd             17.25
sp             17.85
cjl        161098239
cje     2876193792.0
code          000651
Name: (000651, 2015/09/02), dtype: object

### **11.2 使用index会提升查询性能**

- 如果index是唯一的，Pandas会使用哈希表优化，查询性能为O(1)。
- 如果index不是唯一的，但是有序，Pandas会使用二分查找算法，查询性能为O(logN)。
- 如果index是完全随即的，那么每次查找都要扫描全表，查询性能为O(N)

### 实验1：完全随机的顺序查询

In [56]:
#将数据随机打散
from sklearn.utils import shuffle
df_shuffle=shuffle(df)

In [57]:
df_shuffle.head()

                           rq     kp     zg     zd     sp        cjl  \
code   rq
002475 2019/04/30  2019/04/30  26.16  26.58  25.86  26.09   23330087
       2021/04/13  2021/04/13  32.79  34.85  32.79  34.13  100393854
601318 2023/04/06  2023/04/06  45.55  45.55  45.03  45.08   36162706
       2015/09/28  2015/09/28  31.05  31.13  30.68  30.90   27179227
       2021/07/19  2021/07/19  59.88  59.88  58.05  59.35   66650056

                            cje    code
code   rq
002475 2019/04/30  6.087688e+08  002475
       2021/04/13  3.425903e+09  002475
601318 2023/04/06  1.634323e+09  601318
       2015/09/28  8.404111e+08  601318
       2021/07/19  3.912636e+09  601318

In [58]:
#索引是否是递增的
df_shuffle.index.is_monotonic_increasing

False

In [59]:
df_shuffle.index.is_unique

True

In [60]:
#计时，查询id==(300124,'2023/03/31')的性能
%timeit df_shuffle.loc[('300124','2023/03/31')]

139 µs ± 1.42 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

### 实验2：按index排序后的查询

In [61]:
df_sorted=df_shuffle.sort_index()

In [62]:
df_sorted.head()

                           rq     kp     zg     zd     sp        cjl  \
code   rq
000651 2015/09/02  2015/09/02  17.55  18.20  17.25  17.85  161098239
       2015/09/07  2015/09/07  17.88  18.36  17.20  17.32   98055248
       2015/09/08  2015/09/08  17.20  17.67  17.02  17.60   57352881
       2015/09/09  2015/09/09  17.61  18.08  17.47  17.85  109881594
       2015/09/10  2015/09/10  17.60  17.80  17.40  17.45   57359762

                            cje    code
code   rq
000651 2015/09/02  2.876194e+09  000651
       2015/09/07  1.740423e+09  000651
       2015/09/08  9.946880e+08  000651
       2015/09/09  1.957843e+09  000651
       2015/09/10  1.008975e+09  000651

In [63]:
#索引是否是递增的
df_sorted.index.is_monotonic_increasing

True

In [64]:
df_sorted.index.is_unique

True

In [65]:
#计时，查询id==(300124,'2023/03/31')的性能
%timeit df_sorted.loc[('300124','2023/03/31')]

138 µs ± 660 ns per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

**可见排序后查询速度得到了提高，由于本例数据量不大，提升不明显**

### **11.3 使用index能自动对齐数据**

**包括Series和DataFrame，如：索引相同的元素或者列（行）可以自动对齐后进行运算**

In [66]:
s1=pd.Series([1,2,3],index=list('abc'))

In [67]:
s1

a    1
b    2
c    3
dtype: int64

In [68]:
s2=pd.Series([2,3,4],index=list('bcd'))

In [69]:
s2

b    2
c    3
d    4
dtype: int64

In [70]:
s1+s2

a    NaN
b    4.0
c    6.0
d    NaN
dtype: float64

**可见，索引相同的元素自动对其，并完成加法计算，其他两个元素未能正常完成加法运算**

### **11.4 使用index更多更强大的数据结构支持**

**_很多很强大的数据结构_**

- CategoricalIndex,基于分类数据的index,提升性能
- MultiIndex,多维索引，用于group by多维聚合后结果等
- DatatimeIndex,时间类型索引，强调的日期和时间的方法支持

----

## **12. Pandas的Merge语法**

**Pandas怎样实现DataFrame的Merge**  
**Merge相当于SQL的 join, 将不同的表按key关联到一个表**

**merge的语法**

In [1]:
DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, 
                left_index=False, right_index=False, sort=False, 
                suffixes=('_x', '_y'), copy=None, indicator=False, validate=None)

**参数说明：**
```
- right---------DataFrame or named Series，Object to merge with.

- how-----------{‘left’, ‘right’, ‘outer’, ‘inner’, ‘cross’}, default ‘inner’

- on------------label or list.
                Column or index level names to join on. These must be found in both DataFrames. If on is None    
                and not merging on indexes then this defaults to the intersection of the columns in both DataFrames.  
                
- left_on-------label or list, or array-like.  
                Column or index level names to join on in the left DataFrame. Can also be an array or list of arrays 
                of the length of the left DataFrame. These arrays are treated as if they are columns.
                
- right_on------label or list, or array-like
                Column or index level names to join on in the right DataFrame. Can also be an array or list of arrays
                of the length of the right DataFrame. These arrays are treated as if they are columns.
                
- left_index----bool, default False
                Use the index from the left DataFrame as the join key(s). If it is a MultiIndex, the number of keys 
                in the other DataFrame (either the index or a number of columns) must match the number of levels.
                
- right_index---bool, default False
                Use the index from the right DataFrame as the join key. Same caveats as left_index.
                
- sort----------bool, default False
                Sort the join keys lexicographically(按字典顺序) in the result DataFrame. If False, the order of the 
                join keys depends on the join type (how keyword).
                
- suffixes------list-like, default is (“_x”, “_y”)
                A length-2 sequence where each element is optionally a string indicating the suffix（后缀） to add to 
                overlapping column names in left and right respectively. Pass a value of None instead of a string to 
                indicate that the column name from left or right should be left as-is, with no suffix. At least one 
                of the values must not be None.
                
- copy----------bool, default True
                If False, avoid copy if possible.
                
- indicator-----bool or str, default False
                If True, adds a column to the output DataFrame called “_merge” with information on the source of each 
                row（源数据行的有关信息）. The column can be given a different name by providing a string argument. 
                
                关于新增列"-merge"的取值：
                    'left_only'---The column will have a Categorical（分类的，类别的） type with the value of “left_only” 
                                  for observations whose merge key only appears in the left DataFrame, 
                    'right_only---“right_only” for observations whose merge key only appears in the right DataFrame,  
                    'both'--------“both” if the observation’s merge key is found in both DataFrames.

- validate------str, optional
                If specified, checks if merge is of specified type.（如果指定该参数，则检查合并是否为指定类型。）

                类型：
                
                “one_to_one” or “1:1”: check if merge keys are unique in both left and right datasets.
                “one_to_many” or “1:m”: check if merge keys are unique in left dataset.
                “many_to_one” or “m:1”: check if merge keys are unique in right dataset.
                “many_to_many” or “m:m”: allowed, but does not result in checks.
```

**返回值：**
    DataFrame。A DataFrame of the two merged objects.

文档地址：https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

**另外：实现两个DataFrame数据纵向合并的方法：**  

**pandas.concat函数**

**语法：** 
```
        pandas.concat(objs, *, axis=0, join='outer', 
                      ignore_index=False, keys=None, 
                      levels=None, names=None, 
                      verify_integrity=False, 
                      sort=False, copy=None
                    )
```
官方文档：http://pandas.pydata.org/docs/reference/api/pandas.concat.html#pandas.concat

### **12.1 电影数据集的 join 实例**

**电影评分数据集**

是“推荐系统”研究的很好的数据集

包含三个文件：  

1. 用户对电影的评分数据，ratings.dat
2. 用户本身的信息数据，users.dat
3. 电影本身的信息数据,movies.dat

可以关联三张标，形成一张大表

数据集官方地址：https://grouplens.org/datasets/movielens/

In [2]:
import pandas as pd

In [4]:
df_ratings=pd.read_csv(
    '/media/数据盘/pandas/movielens/ml-1m/ratings.dat',
    sep='::',         #长度超过1个字符且与“\s+”不同的分隔符将被解释为正则表达式，并将强制使用Python解析引擎
    engine='python',  #这是pandas的语法要求，当sep参数不是一个字符长度时，它会认为sep的值是一个表达式，这里用engine参数告诉系统
                      #它就是分隔符，不是表达式
    names='UserId::MovieId::Rating::Timestamp'.split('::')
)

In [5]:
df_ratings.head()

   UserId  MovieId  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [9]:
df_users=pd.read_csv(
    '/media/数据盘/pandas/movielens/ml-1m/users.dat',
    sep='::',
    engine='python',
    names='UserId::Gender::Age::Occupation::Zip-code'.split('::')
)

In [11]:
df_users.head()

   UserId Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [13]:
df_movies=pd.read_csv(
    '/media/数据盘/pandas/movielens/ml-1m/movies.dat',
    sep='::',
    engine='python',
    names='MovieId::Title::Genres'.split('::')
)

In [15]:
df_movies.head()

   MovieId                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

第一步合并(merge)

In [16]:
df_ratings_users=pd.merge(df_ratings,df_users,
                          left_on='UserId',
                          right_on='UserId',
                          how='inner'
                         )

In [17]:
df_ratings_users.head()

   UserId  MovieId  Rating  Timestamp Gender  Age  Occupation Zip-code
0       1     1193       5  978300760      F    1          10    48067
1       1      661       3  978302109      F    1          10    48067
2       1      914       3  978301968      F    1          10    48067
3       1     3408       4  978300275      F    1          10    48067
4       1     2355       5  978824291      F    1          10    48067

**一次只能合并两张表，有多张表需要合并时，只能分布实施**

In [20]:
df_ratings_users_movites=pd.merge(df_ratings_users,df_movies,
                                  left_on='MovieId',
                                  right_on='MovieId',
                                  how='inner'
                                 )

In [21]:
df_ratings_users_movites.head()

,UserId,MovieId,Rating,Timestamp,Gender,Age,Occupation,Zip-code,Title,Genres
0,1,661,3,978302109,F,1,10,48067,James and the Giant Peach (1996),Animation|Children's|Musical
1,23,661,2,978460739,M,35,0,90049,James and the Giant Peach (1996),Animation|Children's|Musical
2,49,661,3,977972750,M,18,12,77084,James and the Giant Peach (1996),Animation|Children's|Musical
3,53,661,5,977979726,M,25,0,96931,James and the Giant Peach (1996),Animation|Children's|Musical
4,57,661,4,977935511,M,18,19,30350,James and the Giant Peach (1996),Animation|Children's|Musical

### **12.2 理解 merge 时数量的对其关系**

**以下关系要正确理解**

- “one_to_one” or “1:1”: 一对一关系，关联的键都是唯一的。结果记录数为1*1。check if merge keys are unique in both left and right datasets.
- “one_to_many” or “1:m”: 一对多关系，左边键值唯一，右边不唯一。结果记录数为1*N。check if merge keys are unique in left dataset.
- “many_to_one” or “m:1”: 多对一关系，左边键值不唯一，右边唯一。结果记录数为N*1。check if merge keys are unique in right dataset.
- “many_to_many” or “m:m”: 多对多关系，左右两边键值都不唯一。结果记录数为M*N。allowed, but does not result in checks.

#### **12.2.1 one_to_one，一对一关系的 merge**

In [24]:
left=pd.DataFrame({'sno':[11,22,33,44],'name':['name1','name2','name3','name4']})

In [25]:
right=pd.DataFrame({'sno':[11,22,33,44],'age':[21,22,23,24]})

In [26]:
pd.merge(left,right,on='sno')

   sno   name  age
0   11  name1   21
1   22  name2   22
2   33  name3   23
3   44  name4   24

#### **12.2.2 one_to_many，一对多关系的 merge**

In [27]:
left=pd.DataFrame({'sno':[11,22,33,44],'name':['name1','name2','name3','name4']})

In [29]:
right=pd.DataFrame({'sno':[11,11,11,22,22,33],'grade':['语文88','数学90','英语75','语文66','数学55','英语29']})

In [32]:
#结果记录数以‘多’的一边为准
pd.merge(left,right,on='sno')

   sno   name grade
0   11  name1  语文88
1   11  name1  数学90
2   11  name1  英语75
3   22  name2  语文66
4   22  name2  数学55
5   33  name3  英语29

#### **12.2.3 many_to_many，多对多关系的 merge**

**注意：结果记录数会出现乘法级增加**

In [38]:
left=pd.DataFrame({'sno':[11,11,22,22,22],'爱好':['篮球','羽毛球','乒乓求','篮球','足球']})
left

   sno   爱好
0   11   篮球
1   11  羽毛球
2   22  乒乓求
3   22   篮球
4   22   足球

In [39]:
right=pd.DataFrame({'sno':[11,11,11,22,22,33],'grade':['语文88','数学90','英语75','语文66','数学55','英语29']})
right

   sno grade
0   11  语文88
1   11  数学90
2   11  英语75
3   22  语文66
4   22  数学55
5   33  英语29

In [36]:
pd.merge(left,right,on='sno')

    sno   爱好 grade
0    11   篮球  语文88
1    11   篮球  数学90
2    11   篮球  英语75
3    11  羽毛球  语文88
4    11  羽毛球  数学90
5    11  羽毛球  英语75
6    22  乒乓求  语文66
7    22  乒乓求  数学55
8    22   篮球  语文66
9    22   篮球  数学55
10   22   足球  语文66
11   22   足球  数学55

### **12.3 理解 left join、right join、inner join、outer join 的区别**

![./mergetype.png](mergetype.png)

In [3]:
left=pd.DataFrame({
                   'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']
                  })

In [4]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [5]:
right=pd.DataFrame({
                    'key':['K0','K1','K4','K5'],
                    'C':['C0','C1','C4','C5'],
                    'D':['D0','D1','D4','D5']
                  })

In [6]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K4  C4  D4
3  K5  C5  D5

#### **12.3.1 inner join : 左右都有的行才会出现在结果集中**

In [8]:
pd.merge(left,right,how='inner')  #未指明连接键，则默认用相同列最为连接键，这里是 key

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1

#### **12.3.2 left join : 左边的都会出现在结果集中，右边的对应列值如果无法匹配则自动填为null**

In [9]:
pd.merge(left,right,how='left')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3  NaN  NaN

#### **12.3.3  join : 右边的都会出现在结果集中，左边的对应列值如果无法匹配则自动填为null**

In [10]:
pd.merge(left,right,how='right')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K4  NaN  NaN  C4  D4
3  K5  NaN  NaN  C5  D5

#### **12.3.4 outer join : 左边、右边的所有记录都会出现在结果集中，对应列值如果无法匹配则自动填为null**

In [11]:
pd.merge(left,right,how='outer')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

### **12.4 如果出现非Key的字段重名怎么办**

In [12]:
left=pd.DataFrame({
                   'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']
                  })

In [19]:
right=pd.DataFrame({
                    'key':['K0','K1','K2','K3'],
                    'A':['C0','C1','C4','C5'],
                    'D':['D0','D1','D4','D5']
                  })

In [20]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [21]:
right

  key   A   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C4  D4
3  K3  C5  D5

**这里left、right都有字段'A'**

#### **12.4.1 Pandas默认的处理方法**

In [23]:
pd.merge(left,right,on='key')

  key A_x   B A_y   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C4  D4
3  K3  A3  B3  C5  D5

pandas默认处理办法是：在重名字段后加后缀‘_x’和‘_y’

#### **12.4.2 为重名字段指定后缀**

In [25]:
pd.merge(left,right,on='key',suffixes=('_ll','_rr'))

  key A_ll   B A_rr   D
0  K0   A0  B0   C0  D0
1  K1   A1  B1   C1  D1
2  K2   A2  B2   C4  D4
3  K3   A3  B3   C5  D5

----

## **13. Pandas实现数据的的concat合并**

### **应用场景：**  

- **批量合并相同格式的Excel**
- **给DataFrame添加行**
- **给DataFrame添加列**

### **一句话说明concat语法：**  
- **使用某种合并方式(inner/outer)**
- **沿着某个轴向(axis=0/1)**
- **把多个Pandas对象（DataFrame/Series）合并成一个**

### **concat语法：**  
```
        pandas.concat(
                        objs, *, axis=0, join='outer', ignore_index=False, keys=None, 
                        levels=None, names=None, verify_integrity=False, sort=False, 
                        copy=None
                    )
```

**参数说明：**  
- objs:一个列表，内容可以是DataFrame或Series，可以混合
- axis:默认是0，是0标识按行合并，为1标识按列合并
- join:合并时索引的对其方式，默认是outer join，也可以是inner join
- ignore_index:是否忽略原来的数据索引,若为True将忽略原来索引，并重建新索引

官方文档：https://pandas.pydata.org/docs/reference/api/pandas.concat.html

### **13.1 使用pandas.concat合并数据**

In [27]:
import pandas as pd

In [29]:
import warnings

In [31]:
warnings.filterwarnings('ignore')  #啥意思？

In [33]:
df1=pd.DataFrame({
        'A':['A0','A1','A2','A3'],
        'B':['B0','B1','B2','B3'],
        'C':['C0','C1','C2','C3'],
        'D':['D0','D1','D2','D3'],
        'E':['E0','E1','E2','E3']
})

In [34]:
df2=pd.DataFrame({
        'A':['A4','A5','A6','A7'],
        'B':['B4','B5','B6','B7'],
        'C':['C4','C5','C6','C7'],
        'D':['D4','D5','D6','D7'],
        'F':['F4','F5','F6','F7']
})

In [35]:
df1

    A   B   C   D   E
0  A0  B0  C0  D0  E0
1  A1  B1  C1  D1  E1
2  A2  B2  C2  D2  E2
3  A3  B3  C3  D3  E3

In [36]:
df2

    A   B   C   D   F
0  A4  B4  C4  D4  F4
1  A5  B5  C5  D5  F5
2  A6  B6  C6  D6  F6
3  A7  B7  C7  D7  F7

#### **1. 默认的concat，参数为axis=0,join=outer,ignore_index=False**

In [38]:
pd.concat([df1,df2])

    A   B   C   D    E    F
0  A0  B0  C0  D0   E0  NaN
1  A1  B1  C1  D1   E1  NaN
2  A2  B2  C2  D2   E2  NaN
3  A3  B3  C3  D3   E3  NaN
0  A4  B4  C4  D4  NaN   F4
1  A5  B5  C5  D5  NaN   F5
2  A6  B6  C6  D6  NaN   F6
3  A7  B7  C7  D7  NaN   F7

#### **2. 使用ignore_index=True可以忽略原来的索引**

In [39]:
pd.concat([df1,df2],ignore_index=True)

    A   B   C   D    E    F
0  A0  B0  C0  D0   E0  NaN
1  A1  B1  C1  D1   E1  NaN
2  A2  B2  C2  D2   E2  NaN
3  A3  B3  C3  D3   E3  NaN
4  A4  B4  C4  D4  NaN   F4
5  A5  B5  C5  D5  NaN   F5
6  A6  B6  C6  D6  NaN   F6
7  A7  B7  C7  D7  NaN   F7

#### **3. 使用 join='inner' 忽略不能匹配的列**

In [40]:
pd.concat([df1,df2],ignore_index=True,join='inner')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

#### **3. 使用 axis=1 相当于增加新列**

In [41]:
df1

    A   B   C   D   E
0  A0  B0  C0  D0  E0
1  A1  B1  C1  D1  E1
2  A2  B2  C2  D2  E2
3  A3  B3  C3  D3  E3

- **A: 添加一列（Series）**

In [49]:
s1=pd.Series(list(range(4)),name='F') #这里的name='F'，后面会被用于列名

In [50]:
s1

0    0
1    1
2    2
3    3
Name: F, dtype: int64

In [51]:
pd.concat([df1,s1],ignore_index=False,axis=1) #这里的列名'F'，就是Series的name

    A   B   C   D   E  F
0  A0  B0  C0  D0  E0  0
1  A1  B1  C1  D1  E1  1
2  A2  B2  C2  D2  E2  2
3  A3  B3  C3  D3  E3  3

- **B: 添加多列（Series）**

In [66]:
s2=df1.apply(lambda x:x['A']+'_GG',axis=1)  #取一列作为Series

In [53]:
s2

0    A0_GG
1    A1_GG
2    A2_GG
3    A3_GG
dtype: object

In [55]:
s2.name='G'

In [56]:
s2

0    A0_GG
1    A1_GG
2    A2_GG
3    A3_GG
Name: G, dtype: object

In [57]:
pd.concat([df1,s1,s2],axis=1)

    A   B   C   D   E  F      G
0  A0  B0  C0  D0  E0  0  A0_GG
1  A1  B1  C1  D1  E1  1  A1_GG
2  A2  B2  C2  D2  E2  2  A2_GG
3  A3  B3  C3  D3  E3  3  A3_GG

可见，F列、G列，都是新增的

- **C:合并两个或多个Series**

In [86]:
s1

0    0
1    1
2    2
3    3
Name: F, dtype: int64

In [87]:
s2

0    A0_GG
1    A1_GG
2    A2_GG
3    A3_GG
Name: S2, dtype: object

In [88]:
pd.concat([s1,s2],axis=0)

0        0
1        1
2        2
3        3
0    A0_GG
1    A1_GG
2    A2_GG
3    A3_GG
dtype: object

In [89]:
pd.concat([s1,s2],axis=1)

   F     S2
0  0  A0_GG
1  1  A1_GG
2  2  A2_GG
3  3  A3_GG

In [95]:
s3=df1.apply(lambda x:x[1]+'_HH') #取一行作为Series

In [96]:
s3

A    A1_HH
B    B1_HH
C    C1_HH
D    D1_HH
E    E1_HH
dtype: object

In [97]:
s3.drop('E',inplace=True) #删除一个元素，使其长度与s1,s2相等

In [98]:
s3

A    A1_HH
B    B1_HH
C    C1_HH
D    D1_HH
dtype: object

In [101]:
pd.concat([s1,s2,s3],axis=1,ignore_index=True)

     0      1      2
0  0.0  A0_GG    NaN
1  1.0  A1_GG    NaN
2  2.0  A2_GG    NaN
3  3.0  A3_GG    NaN
A  NaN    NaN  A1_HH
B  NaN    NaN  B1_HH
C  NaN    NaN  C1_HH
D  NaN    NaN  D1_HH

In [110]:
s3.reindex()

A    A1_HH
B    B1_HH
C    C1_HH
D    D1_HH
dtype: object

In [120]:
pd.concat(
    [pd.DataFrame([i],columns=['A']) for i in range(5)],   #没懂！！！猜测这行代码是生成5个只有一行一列的dataframe
    ignore_index=True
)

   A
0  0
1  1
2  2
3  3
4  4

In [122]:
[pd.DataFrame([i],columns=['A']) for i in range(5)] #生成了5个一行一列的dataframe,最外层的方括号使这5个dataframe组成一个list

[   A
 0  0,
    A
 0  1,
    A
 0  2,
    A
 0  3,
    A
 0  4]

In [ ]:
pd.DataFrame([i],columns=['A']) for i in range(5) #这样则不能执行

----

## **14. Pandas批量拆分与合并Excel文件**

1. 将一个大的Excel拆分成多个小的文件
2. 将多个小的Excel文件合并成一个大的，并标记来源

In [125]:
work_dir='/media/数据盘/pandas'
splits_dir=f'{work_dir}/splits'

In [126]:
import os

In [127]:
if not os.path.exists(splits_dir):
    os.makedirs(splits_dir)

### **14.0 使用pandas读取Excel文件**

In [128]:
import pandas as pd

In [129]:
df_source=pd.read_excel(f'{work_dir}/gy202302.xlsx')

In [138]:
df_source.head()

,NF,YF,A01,H02,N2000_1,N2000_2,N2000_3,N2000_4,N4000_1,N4000_2,...,A341,A342,A343,B93,DZX,A07_2017,A14,N2000_2_KBJ,N2000_2_TB,N2000_1_KBJ
0,2023,2,057686533,上海欣禄包装制品有限公司,3554,7542,3376,6179,3554,7542,...,0,0,0,501,3,2231,1,7618.18,7618.18,3589.90
1,2023,2,059324579,上海弘干机械制造有限公司,4109,7425,2335,5418,4109,7425,...,0,0,0,502,3,3311,1,7702.28,7702.28,4262.45
2,2023,2,060907093,上海图正信息科技股份有限公司,200,200,185,185,200,200,...,0,0,0,502,3,3983,1,201.01,201.01,201.01
3,2023,2,060946834,上海东富龙拓溥科技有限公司,84318,90495,29460,54482,5754,8837,...,230105,0,0,502,3,3544,1,90314.37,90314.37,84149.70
4,2023,2,062523851,上海海的实业有限公司,3309,6753,8019,20177,3167,8092,...,0,0,0,502,3,3312,1,7005.19,7005.19,3432.57

In [133]:
df_source.index

RangeIndex(start=0, stop=878, step=1)

In [134]:
df_source.shape

(878, 33)

In [135]:
total_row_count=df_source.shape[0]

In [136]:
total_row_count

878

### **14.1 将一个大的Excel文件拆成多个小的文件**

**1. 使用df.iloc方法将大的DataFrame拆分成小的DataFrame,iloc方法使用数字索引**  
**2. 使用DataFrame.to_excel将dataframe保存为小的Excel文件**

#### **14.1.1 计算拆分后的每个Excel的行数**

In [148]:
#拟将大表分给6个人
usernames=['zhao','qian','sun','li','zhou','wu']

In [162]:
#每个人的记录数
split_size=total_row_count//len(usernames) #整除

In [163]:
split_size

146

In [164]:
if total_row_count%len(usernames) != 0:
    split_size +=1

In [165]:
split_size

147

#### **14.1.2 拆分成多个DataFrame**

In [170]:
list(enumerate(usernames,start=10))

[(10, 'zhao'), (11, 'qian'), (12, 'sun'), (13, 'li'), (14, 'zhou'), (15, 'wu')]

In [174]:
#定义一个存储小dataframe的列表
df_subs=[]

#enumerate() 函数用于将一个可遍历的数据对象(如列表、元组或字符串)组合为一个索引序列，同时列出数据和数据下标，一般用在 for 循环当中。
for idx,user_name in enumerate(usernames):
    begin=idx*split_size # iloc的起始索引
    end=begin+split_size # iloc的终止索引
    buff=df_source.iloc[begin:end] # 拆分，iloc函数使用整数数值索引
    df_subs.append((idx,user_name,buff)) #将子dataframe和索引、归属人员名称一起存入列表

#### **14.1.3 将各个DataFrame分别村如Excel**

In [177]:
for idx,user_name,df_sub in df_subs:
    filename=f'{splits_dir}/gy2023_{idx}_{user_name}.xlsx'
    df_sub.to_excel(filename,index=False)

### **14.2 合并多个小Excel文件到一个大的Excel文件**

1. 遍历文件夹，得到要合并的文件名列表
2. 分别读取到DataFrame,给每个df增加一列，用于标记数据来源
3. 使用pd.concat进行批量df合并
4. 将合并好的DataFrame输出到Excel

#### **14.2.1 遍历文件夹，得到要合并的文件名列表**

In [181]:
import os
excel_names=[]
for excel_name in os.listdir(splits_dir):
    excel_names.append(excel_name)        #如果当前目录下包含子目录或其他非需要的文件，则他们的名字也会被写入列表
excel_names

['gy2023_2_sun.xlsx',
 'gy2023_3_li.xlsx',
 'gy2023_0_zhao.xlsx',
 'gy2023_1_qian.xlsx',
 'gy2023_5_wu.xlsx',
 'gy2023_4_zhou.xlsx']

#### **14.2.2 分别读取到DataFrame**

In [186]:
df_list=[]

for excel_name in excel_names:
    #需读取的文件路径
    excel_path=f'{splits_dir}/{excel_name}'
    
    #读取文件到dataframe中
    df_split=pd.read_excel(excel_path)
    
    #从文件名中提取用户名
    username=excel_name.replace('gy2023_','').replace('.xlsx','')[2:]
    
    print(excel_name,username)
    
    #为dataframe增加一列，用于保存用户名
    df_split['username']=username
    
    df_list.append(df_split)

gy2023_2_sun.xlsx sun
gy2023_3_li.xlsx li
gy2023_0_zhao.xlsx zhao
gy2023_1_qian.xlsx qian
gy2023_5_wu.xlsx wu
gy2023_4_zhou.xlsx zhou

#### **14.2.3 使用pd.concat进行合并**

In [188]:
df_merge=pd.concat(df_list)

In [189]:
df_merge.shape

(878, 34)

In [190]:
df_merge.head()

,NF,YF,A01,H02,N2000_1,N2000_2,N2000_3,N2000_4,N4000_1,N4000_2,...,A342,A343,B93,DZX,A07_2017,A14,N2000_2_KBJ,N2000_2_TB,N2000_1_KBJ,username
0,2023,2,607375685,上海袋式除尘配件有限公司,5020,10232,5506,12934,7444,9976,...,0,0,502,3,3591,1,9885.99,9885.99,4850.24,sun
1,2023,2,607375992,上海泰惠电器有限公司,2620,4228,1780,4378,3030,5290,...,290102,0,501,3,3854,1,4081.08,4081.08,2528.96,sun
2,2023,2,607376741,上海欧通电气有限公司,25747,44615,23616,52259,22895,40433,...,110104,290102,502,3,3823,1,44704.41,44704.41,25798.60,sun
3,2023,2,607377285,弗曼科斯(上海)电子有限公司,1702,2141,253,1506,2141,3511,...,0,0,502,3,3990,1,2099.02,2099.02,1668.63,sun
4,2023,2,607380214,士商(上海)机械有限公司,11896,24625,9846,40152,11896,24625,...,0,0,502,3,3329,1,24873.74,24873.74,12016.16,sun

In [191]:
df_merge['username'].value_counts()

sun     147
li      147
zhao    147
qian    147
zhou    147
wu      143
Name: username, dtype: int64

#### **14.2.4 将合并后的DataFrame输出到Excel**

In [193]:
df_merge.to_excel(f'{work_dir}/gy202302_merge.xlsx',index=False)